Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk1024gpd100.h
extern volatile __T4CONbits_t T4CONbits __asm__ ("T4CON") __attribute__((section("sfrs"), address(0xBF820600)));
extern volatile uint32_t        T4CONCLR __attribute__((section("sfrs"),address(0xBF820604)));
extern volatile uint32_t        T4CONSET __attribute__((section("sfrs"),address(0xBF820608)));
extern volatile uint32_t        T4CONINV __attribute__((section("sfrs"),address(0xBF82060C)));
#define TMR4 TMR4
extern volatile uint32_t   TMR4 __attribute__((section("sfrs"), address(0xBF820610)));
extern volatile uint32_t        TMR4CLR __attribute__((section("sfrs"),address(0xBF820614)));
extern volatile uint32_t        TMR4SET __attribute__((section("sfrs"),address(0xBF820618)));
extern volatile uint32_t        TMR4INV __attribute__((section("sfrs"),address(0xBF82061C)));
#define PR4 PR4
extern volatile uint32_t   PR4 __attribute__((section("sfrs"), address(0xBF820620)));
extern volatile uint32_t        PR4CLR __attribute__((section("sfrs"),address(0xBF820624)));
extern volatile uint32_t        PR4SET __attribute__((section("sfrs"),address(0xBF820628)));
extern volatile uint32_t        PR4INV __attribute__((section("sfrs"),address(0xBF82062C)));
#define T5CON T5CON
extern volatile uint32_t   T5CON __attribute__((section("sfrs"), address(0xBF820800)));
typedef struct {
  uint32_t :1;
  uint32_t TCS:1;
  uint32_t :1;
  uint32_t T32:1;
  uint32_t TCKPS:3;
  uint32_t TGATE:1;
  uint32_t SYNC:1;
  uint32_t :4;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __T5CONbits_t;
extern volatile __T5CONbits_t T5CONbits __asm__ ("T5CON") __attribute__((section("sfrs"), address(0xBF820800)));
extern volatile uint32_t        T5CONCLR __attribute__((section("sfrs"),address(0xBF820804)));
extern volatile uint32_t        T5CONSET __attribute__((section("sfrs"),address(0xBF820808)));
extern volatile uint32_t        T5CONINV __attribute__((section("sfrs"),address(0xBF82080C)));
#define TMR5 TMR5
extern volatile uint32_t   TMR5 __attribute__((section("sfrs"), address(0xBF820810)));
extern volatile uint32_t        TMR5CLR __attribute__((section("sfrs"),address(0xBF820814)));
extern volatile uint32_t        TMR5SET __attribute__((section("sfrs"),address(0xBF820818)));
extern volatile uint32_t        TMR5INV __attribute__((section("sfrs"),address(0xBF82081C)));
#define PR5 PR5
extern volatile uint32_t   PR5 __attribute__((section("sfrs"), address(0xBF820820)));
extern volatile uint32_t        PR5CLR __attribute__((section("sfrs"),address(0xBF820824)));
extern volatile uint32_t        PR5SET __attribute__((section("sfrs"),address(0xBF820828)));
extern volatile uint32_t        PR5INV __attribute__((section("sfrs"),address(0xBF82082C)));
#define T6CON T6CON
extern volatile uint32_t   T6CON __attribute__((section("sfrs"), address(0xBF820A00)));
typedef struct {
  uint32_t :1;
  uint32_t TCS:1;
  uint32_t :1;
  uint32_t T32:1;
  uint32_t TCKPS:3;
  uint32_t TGATE:1;
  uint32_t SYNC:1;
  uint32_t :4;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __T6CONbits_t;
extern volatile __T6CONbits_t T6CONbits __asm__ ("T6CON") __attribute__((section("sfrs"), address(0xBF820A00)));
extern volatile uint32_t        T6CONCLR __attribute__((section("sfrs"),address(0xBF820A04)));
extern volatile uint32_t        T6CONSET __attribute__((section("sfrs"),address(0xBF820A08)));
extern volatile uint32_t        T6CONINV __attribute__((section("sfrs"),address(0xBF820A0C)));
#define TMR6 TMR6
extern volatile uint32_t   TMR6 __attribute__((section("sfrs"), address(0xBF820A10)));
extern volatile uint32_t        TMR6CLR __attribute__((section("sfrs"),address(0xBF820A14)));
extern volatile uint32_t        TMR6SET __attribute__((section("sfrs"),address(0xBF820A18)));
extern volatile uint32_t        TMR6INV __attribute__((section("sfrs"),address(0xBF820A1C)));
#define PR6 PR6
extern volatile uint32_t   PR6 __attribute__((section("sfrs"), address(0xBF820A20)));
extern volatile uint32_t        PR6CLR __attribute__((section("sfrs"),address(0xBF820A24)));
extern volatile uint32_t        PR6SET __attribute__((section("sfrs"),address(0xBF820A28)));
extern volatile uint32_t        PR6INV __attribute__((section("sfrs"),address(0xBF820A2C)));
#define T7CON T7CON
extern volatile uint32_t   T7CON __attribute__((section("sfrs"), address(0xBF820C00)));
typedef struct {
  uint32_t :1;
  uint32_t TCS:1;
  uint32_t :1;
  uint32_t T32:1;
  uint32_t TCKPS:3;
  uint32_t TGATE:1;
  uint32_t SYNC:1;
  uint32_t :4;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __T7CONbits_t;
extern volatile __T7CONbits_t T7CONbits __asm__ ("T7CON") __attribute__((section("sfrs"), address(0xBF820C00)));
extern volatile uint32_t        T7CONCLR __attribute__((section("sfrs"),address(0xBF820C04)));
extern volatile uint32_t        T7CONSET __attribute__((section("sfrs"),address(0xBF820C08)));
extern volatile uint32_t        T7CONINV __attribute__((section("sfrs"),address(0xBF820C0C)));
#define TMR7 TMR7
extern volatile uint32_t   TMR7 __attribute__((section("sfrs"), address(0xBF820C10)));
extern volatile uint32_t        TMR7CLR __attribute__((section("sfrs"),address(0xBF820C14)));
extern volatile uint32_t        TMR7SET __attribute__((section("sfrs"),address(0xBF820C18)));
extern volatile uint32_t        TMR7INV __attribute__((section("sfrs"),address(0xBF820C1C)));
#define PR7 PR7
extern volatile uint32_t   PR7 __attribute__((section("sfrs"), address(0xBF820C20)));
extern volatile uint32_t        PR7CLR __attribute__((section("sfrs"),address(0xBF820C24)));
extern volatile uint32_t        PR7SET __attribute__((section("sfrs"),address(0xBF820C28)));
extern volatile uint32_t        PR7INV __attribute__((section("sfrs"),address(0xBF820C2C)));
#define T8CON T8CON
extern volatile uint32_t   T8CON __attribute__((section("sfrs"), address(0xBF820E00)));
typedef struct {
  uint32_t :1;
  uint32_t TCS:1;
  uint32_t :1;
  uint32_t T32:1;
  uint32_t TCKPS:3;
  uint32_t TGATE:1;
  uint32_t SYNC:1;
  uint32_t :4;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __T8CONbits_t;
extern volatile __T8CONbits_t T8CONbits __asm__ ("T8CON") __attribute__((section("sfrs"), address(0xBF820E00)));
extern volatile uint32_t        T8CONCLR __attribute__((section("sfrs"),address(0xBF820E04)));
extern volatile uint32_t        T8CONSET __attribute__((section("sfrs"),address(0xBF820E08)));
extern volatile uint32_t        T8CONINV __attribute__((section("sfrs"),address(0xBF820E0C)));
#define TMR8 TMR8
extern volatile uint32_t   TMR8 __attribute__((section("sfrs"), address(0xBF820E10)));
extern volatile uint32_t        TMR8CLR __attribute__((section("sfrs"),address(0xBF820E14)));
extern volatile uint32_t        TMR8SET __attribute__((section("sfrs"),address(0xBF820E18)));
extern volatile uint32_t        TMR8INV __attribute__((section("sfrs"),address(0xBF820E1C)));
#define PR8 PR8
extern volatile uint32_t   PR8 __attribute__((section("sfrs"), address(0xBF820E20)));
extern volatile uint32_t        PR8CLR __attribute__((section("sfrs"),address(0xBF820E24)));
extern volatile uint32_t        PR8SET __attribute__((section("sfrs"),address(0xBF820E28)));
extern volatile uint32_t        PR8INV __attribute__((section("sfrs"),address(0xBF820E2C)));
#define T9CON T9CON
extern volatile uint32_t   T9CON __attribute__((section("sfrs"), address(0xBF821000)));
typedef struct {
  uint32_t :1;
  uint32_t TCS:1;
  uint32_t :1;
  uint32_t T32:1;
  uint32_t TCKPS:3;
  uint32_t TGATE:1;
  uint32_t SYNC:1;
  uint32_t :4;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __T9CONbits_t;
extern volatile __T9CONbits_t T9CONbits __asm__ ("T9CON") __attribute__((section("sfrs"), address(0xBF821000)));
extern volatile uint32_t        T9CONCLR __attribute__((section("sfrs"),address(0xBF821004)));
extern volatile uint32_t        T9CONSET __attribute__((section("sfrs"),address(0xBF821008)));
extern volatile uint32_t        T9CONINV __attribute__((section("sfrs"),address(0xBF82100C)));
#define TMR9 TMR9
extern volatile uint32_t   TMR9 __attribute__((section("sfrs"), address(0xBF821010)));
extern volatile uint32_t        TMR9CLR __attribute__((section("sfrs"),address(0xBF821014)));
extern volatile uint32_t        TMR9SET __attribute__((section("sfrs"),address(0xBF821018)));
extern volatile uint32_t        TMR9INV __attribute__((section("sfrs"),address(0xBF82101C)));
#define PR9 PR9
extern volatile uint32_t   PR9 __attribute__((section("sfrs"), address(0xBF821020)));
extern volatile uint32_t        PR9CLR __attribute__((section("sfrs"),address(0xBF821024)));
extern volatile uint32_t        PR9SET __attribute__((section("sfrs"),address(0xBF821028)));
extern volatile uint32_t        PR9INV __attribute__((section("sfrs"),address(0xBF82102C)));
#define IC1CON IC1CON
extern volatile uint32_t   IC1CON __attribute__((section("sfrs"), address(0xBF822000)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC1CONbits_t;
extern volatile __IC1CONbits_t IC1CONbits __asm__ ("IC1CON") __attribute__((section("sfrs"), address(0xBF822000)));
extern volatile uint32_t        IC1CONCLR __attribute__((section("sfrs"),address(0xBF822004)));
extern volatile uint32_t        IC1CONSET __attribute__((section("sfrs"),address(0xBF822008)));
extern volatile uint32_t        IC1CONINV __attribute__((section("sfrs"),address(0xBF82200C)));
#define IC1BUF IC1BUF
extern volatile uint32_t   IC1BUF __attribute__((section("sfrs"), address(0xBF822010)));
#define IC2CON IC2CON
extern volatile uint32_t   IC2CON __attribute__((section("sfrs"), address(0xBF822200)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC2CONbits_t;
