Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk1024gpd100.h
extern volatile __ADC0CFGbits_t ADC0CFGbits __asm__ ("ADC0CFG") __attribute__((section("sfrs"), address(0xBF887D00)));
extern volatile uint32_t        ADC0CFGCLR __attribute__((section("sfrs"),address(0xBF887D04)));
extern volatile uint32_t        ADC0CFGSET __attribute__((section("sfrs"),address(0xBF887D08)));
extern volatile uint32_t        ADC0CFGINV __attribute__((section("sfrs"),address(0xBF887D0C)));
#define ADC1CFG ADC1CFG
extern volatile uint32_t   ADC1CFG __attribute__((section("sfrs"), address(0xBF887D10)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC1CFGbits_t;
extern volatile __ADC1CFGbits_t ADC1CFGbits __asm__ ("ADC1CFG") __attribute__((section("sfrs"), address(0xBF887D10)));
extern volatile uint32_t        ADC1CFGCLR __attribute__((section("sfrs"),address(0xBF887D14)));
extern volatile uint32_t        ADC1CFGSET __attribute__((section("sfrs"),address(0xBF887D18)));
extern volatile uint32_t        ADC1CFGINV __attribute__((section("sfrs"),address(0xBF887D1C)));
#define ADC2CFG ADC2CFG
extern volatile uint32_t   ADC2CFG __attribute__((section("sfrs"), address(0xBF887D20)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC2CFGbits_t;
extern volatile __ADC2CFGbits_t ADC2CFGbits __asm__ ("ADC2CFG") __attribute__((section("sfrs"), address(0xBF887D20)));
extern volatile uint32_t        ADC2CFGCLR __attribute__((section("sfrs"),address(0xBF887D24)));
extern volatile uint32_t        ADC2CFGSET __attribute__((section("sfrs"),address(0xBF887D28)));
extern volatile uint32_t        ADC2CFGINV __attribute__((section("sfrs"),address(0xBF887D2C)));
#define ADC3CFG ADC3CFG
extern volatile uint32_t   ADC3CFG __attribute__((section("sfrs"), address(0xBF887D30)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC3CFGbits_t;
extern volatile __ADC3CFGbits_t ADC3CFGbits __asm__ ("ADC3CFG") __attribute__((section("sfrs"), address(0xBF887D30)));
extern volatile uint32_t        ADC3CFGCLR __attribute__((section("sfrs"),address(0xBF887D34)));
extern volatile uint32_t        ADC3CFGSET __attribute__((section("sfrs"),address(0xBF887D38)));
extern volatile uint32_t        ADC3CFGINV __attribute__((section("sfrs"),address(0xBF887D3C)));
#define ADC4CFG ADC4CFG
extern volatile uint32_t   ADC4CFG __attribute__((section("sfrs"), address(0xBF887D40)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC4CFGbits_t;
extern volatile __ADC4CFGbits_t ADC4CFGbits __asm__ ("ADC4CFG") __attribute__((section("sfrs"), address(0xBF887D40)));
extern volatile uint32_t        ADC4CFGCLR __attribute__((section("sfrs"),address(0xBF887D44)));
extern volatile uint32_t        ADC4CFGSET __attribute__((section("sfrs"),address(0xBF887D48)));
extern volatile uint32_t        ADC4CFGINV __attribute__((section("sfrs"),address(0xBF887D4C)));
#define ADC5CFG ADC5CFG
extern volatile uint32_t   ADC5CFG __attribute__((section("sfrs"), address(0xBF887D50)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC5CFGbits_t;
extern volatile __ADC5CFGbits_t ADC5CFGbits __asm__ ("ADC5CFG") __attribute__((section("sfrs"), address(0xBF887D50)));
extern volatile uint32_t        ADC5CFGCLR __attribute__((section("sfrs"),address(0xBF887D54)));
extern volatile uint32_t        ADC5CFGSET __attribute__((section("sfrs"),address(0xBF887D58)));
extern volatile uint32_t        ADC5CFGINV __attribute__((section("sfrs"),address(0xBF887D5C)));
#define ADC7CFG ADC7CFG
extern volatile uint32_t   ADC7CFG __attribute__((section("sfrs"), address(0xBF887D70)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC7CFGbits_t;
extern volatile __ADC7CFGbits_t ADC7CFGbits __asm__ ("ADC7CFG") __attribute__((section("sfrs"), address(0xBF887D70)));
extern volatile uint32_t        ADC7CFGCLR __attribute__((section("sfrs"),address(0xBF887D74)));
extern volatile uint32_t        ADC7CFGSET __attribute__((section("sfrs"),address(0xBF887D78)));
extern volatile uint32_t        ADC7CFGINV __attribute__((section("sfrs"),address(0xBF887D7C)));
#define ADCSYSCFG0 ADCSYSCFG0
extern volatile uint32_t   ADCSYSCFG0 __attribute__((section("sfrs"), address(0xBF887E00)));
typedef struct {
  uint32_t AN0:1;
  uint32_t AN1:1;
  uint32_t AN2:1;
  uint32_t AN3:1;
  uint32_t AN4:1;
  uint32_t AN5:1;
  uint32_t AN6:1;
  uint32_t AN7:1;
  uint32_t AN8:1;
  uint32_t AN9:1;
  uint32_t AN10:1;
  uint32_t AN11:1;
  uint32_t AN12:1;
  uint32_t AN13:1;
  uint32_t AN14:1;
  uint32_t AN15:1;
  uint32_t AN16:1;
  uint32_t AN17:1;
  uint32_t AN18:1;
  uint32_t AN19:1;
  uint32_t AN20:1;
  uint32_t AN21:1;
  uint32_t AN22:1;
  uint32_t AN23:1;
  uint32_t AN24:1;
  uint32_t AN25:1;
  uint32_t AN26:1;
  uint32_t AN27:1;
} __ADCSYSCFG0bits_t;
extern volatile __ADCSYSCFG0bits_t ADCSYSCFG0bits __asm__ ("ADCSYSCFG0") __attribute__((section("sfrs"), address(0xBF887E00)));
extern volatile uint32_t        ADCSYSCFG0CLR __attribute__((section("sfrs"),address(0xBF887E04)));
extern volatile uint32_t        ADCSYSCFG0SET __attribute__((section("sfrs"),address(0xBF887E08)));
extern volatile uint32_t        ADCSYSCFG0INV __attribute__((section("sfrs"),address(0xBF887E0C)));
#define ADCSYSCFG1 ADCSYSCFG1
extern volatile uint32_t   ADCSYSCFG1 __attribute__((section("sfrs"), address(0xBF887E10)));
typedef struct {
  uint32_t :1;
  uint32_t AN33:1;
  uint32_t AN34:1;
  uint32_t AN35:1;
  uint32_t AN36:1;
  uint32_t AN37:1;
  uint32_t AN38:1;
  uint32_t AN39:1;
  uint32_t AN40:1;
  uint32_t AN41:1;
  uint32_t :3;
  uint32_t AN45:1;
  uint32_t AN46:1;
  uint32_t AN47:1;
  uint32_t AN48:1;
  uint32_t AN49:1;
  uint32_t AN50:1;
  uint32_t AN51:1;
  uint32_t AN52:1;
  uint32_t AN53:1;
} __ADCSYSCFG1bits_t;
extern volatile __ADCSYSCFG1bits_t ADCSYSCFG1bits __asm__ ("ADCSYSCFG1") __attribute__((section("sfrs"), address(0xBF887E10)));
extern volatile uint32_t        ADCSYSCFG1CLR __attribute__((section("sfrs"),address(0xBF887E14)));
extern volatile uint32_t        ADCSYSCFG1SET __attribute__((section("sfrs"),address(0xBF887E18)));
extern volatile uint32_t        ADCSYSCFG1INV __attribute__((section("sfrs"),address(0xBF887E1C)));
#define U1OTGIR U1OTGIR
extern volatile uint32_t   U1OTGIR __attribute__((section("sfrs"), address(0xBF889040)));
typedef struct {
  uint32_t VBUSVDIF:1;
  uint32_t :1;
  uint32_t SESENDIF:1;
  uint32_t SESVDIF:1;
  uint32_t ACTVIF:1;
  uint32_t LSTATEIF:1;
  uint32_t T1MSECIF:1;
  uint32_t IDIF:1;
} __U1OTGIRbits_t;
extern volatile __U1OTGIRbits_t U1OTGIRbits __asm__ ("U1OTGIR") __attribute__((section("sfrs"), address(0xBF889040)));
extern volatile uint32_t        U1OTGIRCLR __attribute__((section("sfrs"),address(0xBF889044)));
#define U1OTGIE U1OTGIE
extern volatile uint32_t   U1OTGIE __attribute__((section("sfrs"), address(0xBF889050)));
typedef struct {
  uint32_t VBUSVDIE:1;
  uint32_t :1;
  uint32_t SESENDIE:1;
  uint32_t SESVDIE:1;
  uint32_t ACTVIE:1;
  uint32_t LSTATEIE:1;
  uint32_t T1MSECIE:1;
  uint32_t IDIE:1;
} __U1OTGIEbits_t;
extern volatile __U1OTGIEbits_t U1OTGIEbits __asm__ ("U1OTGIE") __attribute__((section("sfrs"), address(0xBF889050)));
extern volatile uint32_t        U1OTGIECLR __attribute__((section("sfrs"),address(0xBF889054)));
extern volatile uint32_t        U1OTGIESET __attribute__((section("sfrs"),address(0xBF889058)));
extern volatile uint32_t        U1OTGIEINV __attribute__((section("sfrs"),address(0xBF88905C)));
#define U1OTGSTAT U1OTGSTAT
extern volatile uint32_t   U1OTGSTAT __attribute__((section("sfrs"), address(0xBF889060)));
typedef struct {
  uint32_t VBUSVD:1;
  uint32_t :1;
  uint32_t SESEND:1;
  uint32_t SESVD:1;
  uint32_t :1;
  uint32_t LSTATE:1;
  uint32_t :1;
  uint32_t ID:1;
} __U1OTGSTATbits_t;
