Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk1024gpd100.h
extern volatile __SBT0WR1bits_t SBT0WR1bits __asm__ ("SBT0WR1") __attribute__((section("sfrs"), address(0xBF8F8078)));
#define SBT1ELOG1 SBT1ELOG1
extern volatile uint32_t   SBT1ELOG1 __attribute__((section("sfrs"), address(0xBF8F8420)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT1ELOG1bits_t;
extern volatile __SBT1ELOG1bits_t SBT1ELOG1bits __asm__ ("SBT1ELOG1") __attribute__((section("sfrs"), address(0xBF8F8420)));
#define SBT1ELOG2 SBT1ELOG2
extern volatile uint32_t   SBT1ELOG2 __attribute__((section("sfrs"), address(0xBF8F8424)));
typedef struct {
  uint32_t GROUP:2;
} __SBT1ELOG2bits_t;
extern volatile __SBT1ELOG2bits_t SBT1ELOG2bits __asm__ ("SBT1ELOG2") __attribute__((section("sfrs"), address(0xBF8F8424)));
#define SBT1ECON SBT1ECON
extern volatile uint32_t   SBT1ECON __attribute__((section("sfrs"), address(0xBF8F8428)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT1ECONbits_t;
extern volatile __SBT1ECONbits_t SBT1ECONbits __asm__ ("SBT1ECON") __attribute__((section("sfrs"), address(0xBF8F8428)));
#define SBT1ECLRS SBT1ECLRS
extern volatile uint32_t   SBT1ECLRS __attribute__((section("sfrs"), address(0xBF8F8430)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT1ECLRSbits_t;
extern volatile __SBT1ECLRSbits_t SBT1ECLRSbits __asm__ ("SBT1ECLRS") __attribute__((section("sfrs"), address(0xBF8F8430)));
#define SBT1ECLRM SBT1ECLRM
extern volatile uint32_t   SBT1ECLRM __attribute__((section("sfrs"), address(0xBF8F8438)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT1ECLRMbits_t;
extern volatile __SBT1ECLRMbits_t SBT1ECLRMbits __asm__ ("SBT1ECLRM") __attribute__((section("sfrs"), address(0xBF8F8438)));
#define SBT1REG0 SBT1REG0
extern volatile uint32_t   SBT1REG0 __attribute__((section("sfrs"), address(0xBF8F8440)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG0bits_t;
extern volatile __SBT1REG0bits_t SBT1REG0bits __asm__ ("SBT1REG0") __attribute__((section("sfrs"), address(0xBF8F8440)));
#define SBT1RD0 SBT1RD0
extern volatile uint32_t   SBT1RD0 __attribute__((section("sfrs"), address(0xBF8F8450)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD0bits_t;
extern volatile __SBT1RD0bits_t SBT1RD0bits __asm__ ("SBT1RD0") __attribute__((section("sfrs"), address(0xBF8F8450)));
#define SBT1WR0 SBT1WR0
extern volatile uint32_t   SBT1WR0 __attribute__((section("sfrs"), address(0xBF8F8458)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR0bits_t;
extern volatile __SBT1WR0bits_t SBT1WR0bits __asm__ ("SBT1WR0") __attribute__((section("sfrs"), address(0xBF8F8458)));
#define SBT1REG2 SBT1REG2
extern volatile uint32_t   SBT1REG2 __attribute__((section("sfrs"), address(0xBF8F8480)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG2bits_t;
extern volatile __SBT1REG2bits_t SBT1REG2bits __asm__ ("SBT1REG2") __attribute__((section("sfrs"), address(0xBF8F8480)));
#define SBT1RD2 SBT1RD2
extern volatile uint32_t   SBT1RD2 __attribute__((section("sfrs"), address(0xBF8F8490)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD2bits_t;
extern volatile __SBT1RD2bits_t SBT1RD2bits __asm__ ("SBT1RD2") __attribute__((section("sfrs"), address(0xBF8F8490)));
#define SBT1WR2 SBT1WR2
extern volatile uint32_t   SBT1WR2 __attribute__((section("sfrs"), address(0xBF8F8498)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR2bits_t;
extern volatile __SBT1WR2bits_t SBT1WR2bits __asm__ ("SBT1WR2") __attribute__((section("sfrs"), address(0xBF8F8498)));
#define SBT1REG3 SBT1REG3
extern volatile uint32_t   SBT1REG3 __attribute__((section("sfrs"), address(0xBF8F84A0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG3bits_t;
extern volatile __SBT1REG3bits_t SBT1REG3bits __asm__ ("SBT1REG3") __attribute__((section("sfrs"), address(0xBF8F84A0)));
#define SBT1RD3 SBT1RD3
extern volatile uint32_t   SBT1RD3 __attribute__((section("sfrs"), address(0xBF8F84B0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD3bits_t;
extern volatile __SBT1RD3bits_t SBT1RD3bits __asm__ ("SBT1RD3") __attribute__((section("sfrs"), address(0xBF8F84B0)));
#define SBT1WR3 SBT1WR3
extern volatile uint32_t   SBT1WR3 __attribute__((section("sfrs"), address(0xBF8F84B8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR3bits_t;
extern volatile __SBT1WR3bits_t SBT1WR3bits __asm__ ("SBT1WR3") __attribute__((section("sfrs"), address(0xBF8F84B8)));
#define SBT1REG4 SBT1REG4
extern volatile uint32_t   SBT1REG4 __attribute__((section("sfrs"), address(0xBF8F84C0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG4bits_t;
extern volatile __SBT1REG4bits_t SBT1REG4bits __asm__ ("SBT1REG4") __attribute__((section("sfrs"), address(0xBF8F84C0)));
#define SBT1RD4 SBT1RD4
extern volatile uint32_t   SBT1RD4 __attribute__((section("sfrs"), address(0xBF8F84D0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD4bits_t;
extern volatile __SBT1RD4bits_t SBT1RD4bits __asm__ ("SBT1RD4") __attribute__((section("sfrs"), address(0xBF8F84D0)));
#define SBT1WR4 SBT1WR4
extern volatile uint32_t   SBT1WR4 __attribute__((section("sfrs"), address(0xBF8F84D8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR4bits_t;
extern volatile __SBT1WR4bits_t SBT1WR4bits __asm__ ("SBT1WR4") __attribute__((section("sfrs"), address(0xBF8F84D8)));
#define SBT1REG5 SBT1REG5
extern volatile uint32_t   SBT1REG5 __attribute__((section("sfrs"), address(0xBF8F84E0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG5bits_t;
extern volatile __SBT1REG5bits_t SBT1REG5bits __asm__ ("SBT1REG5") __attribute__((section("sfrs"), address(0xBF8F84E0)));
#define SBT1RD5 SBT1RD5
extern volatile uint32_t   SBT1RD5 __attribute__((section("sfrs"), address(0xBF8F84F0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD5bits_t;
