Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk1024gpd100.h
#define _IEC4_AD1D45IE_POSITION                  0x00000017
#define _IEC4_AD1D45IE_MASK                      0x00800000
#define _IEC4_AD1D45IE_LENGTH                    0x00000001

#define _IEC4_AD1D46IE_POSITION                  0x00000018
#define _IEC4_AD1D46IE_MASK                      0x01000000
#define _IEC4_AD1D46IE_LENGTH                    0x00000001

#define _IEC4_AD1D47IE_POSITION                  0x00000019
#define _IEC4_AD1D47IE_MASK                      0x02000000
#define _IEC4_AD1D47IE_LENGTH                    0x00000001

#define _IEC4_AD1D48IE_POSITION                  0x0000001A
#define _IEC4_AD1D48IE_MASK                      0x04000000
#define _IEC4_AD1D48IE_LENGTH                    0x00000001

#define _IEC4_AD1D49IE_POSITION                  0x0000001B
#define _IEC4_AD1D49IE_MASK                      0x08000000
#define _IEC4_AD1D49IE_LENGTH                    0x00000001

#define _IEC4_AD1D50IE_POSITION                  0x0000001C
#define _IEC4_AD1D50IE_MASK                      0x10000000
#define _IEC4_AD1D50IE_LENGTH                    0x00000001

#define _IEC4_AD1D51IE_POSITION                  0x0000001D
#define _IEC4_AD1D51IE_MASK                      0x20000000
#define _IEC4_AD1D51IE_LENGTH                    0x00000001

#define _IEC4_AD1D52IE_POSITION                  0x0000001E
#define _IEC4_AD1D52IE_MASK                      0x40000000
#define _IEC4_AD1D52IE_LENGTH                    0x00000001

#define _IEC4_AD1D53IE_POSITION                  0x0000001F
#define _IEC4_AD1D53IE_MASK                      0x80000000
#define _IEC4_AD1D53IE_LENGTH                    0x00000001

#define _IEC4_w_POSITION                         0x00000000
#define _IEC4_w_MASK                             0xFFFFFFFF
#define _IEC4_w_LENGTH                           0x00000020

#define _IEC5_CMP3IE_POSITION                    0x00000000
#define _IEC5_CMP3IE_MASK                        0x00000001
#define _IEC5_CMP3IE_LENGTH                      0x00000001

#define _IEC5_CMP4IE_POSITION                    0x00000001
#define _IEC5_CMP4IE_MASK                        0x00000002
#define _IEC5_CMP4IE_LENGTH                      0x00000001

#define _IEC5_CMP5IE_POSITION                    0x00000002
#define _IEC5_CMP5IE_MASK                        0x00000004
#define _IEC5_CMP5IE_LENGTH                      0x00000001

#define _IEC5_U6EIE_POSITION                     0x00000004
#define _IEC5_U6EIE_MASK                         0x00000010
#define _IEC5_U6EIE_LENGTH                       0x00000001

#define _IEC5_U6RXIE_POSITION                    0x00000005
#define _IEC5_U6RXIE_MASK                        0x00000020
#define _IEC5_U6RXIE_LENGTH                      0x00000001

#define _IEC5_U6TXIE_POSITION                    0x00000006
#define _IEC5_U6TXIE_MASK                        0x00000040
#define _IEC5_U6TXIE_LENGTH                      0x00000001

#define _IEC5_I2C3BIE_POSITION                   0x00000013
#define _IEC5_I2C3BIE_MASK                       0x00080000
#define _IEC5_I2C3BIE_LENGTH                     0x00000001

#define _IEC5_I2C3SIE_POSITION                   0x00000014
#define _IEC5_I2C3SIE_MASK                       0x00100000
#define _IEC5_I2C3SIE_LENGTH                     0x00000001

#define _IEC5_I2C3MIE_POSITION                   0x00000015
#define _IEC5_I2C3MIE_MASK                       0x00200000
#define _IEC5_I2C3MIE_LENGTH                     0x00000001

#define _IEC5_DMA4IE_POSITION                    0x00000016
#define _IEC5_DMA4IE_MASK                        0x00400000
#define _IEC5_DMA4IE_LENGTH                      0x00000001

#define _IEC5_DMA5IE_POSITION                    0x00000017
#define _IEC5_DMA5IE_MASK                        0x00800000
#define _IEC5_DMA5IE_LENGTH                      0x00000001

#define _IEC5_DMA6IE_POSITION                    0x00000018
#define _IEC5_DMA6IE_MASK                        0x01000000
#define _IEC5_DMA6IE_LENGTH                      0x00000001

#define _IEC5_DMA7IE_POSITION                    0x00000019
#define _IEC5_DMA7IE_MASK                        0x02000000
#define _IEC5_DMA7IE_LENGTH                      0x00000001

#define _IEC5_DATAEEIE_POSITION                  0x0000001A
#define _IEC5_DATAEEIE_MASK                      0x04000000
#define _IEC5_DATAEEIE_LENGTH                    0x00000001

#define _IEC5_w_POSITION                         0x00000000
#define _IEC5_w_MASK                             0xFFFFFFFF
#define _IEC5_w_LENGTH                           0x00000020

#define _IEC6_I2C4BIE_POSITION                   0x00000002
#define _IEC6_I2C4BIE_MASK                       0x00000004
#define _IEC6_I2C4BIE_LENGTH                     0x00000001

#define _IEC6_I2C4SIE_POSITION                   0x00000003
#define _IEC6_I2C4SIE_MASK                       0x00000008
#define _IEC6_I2C4SIE_LENGTH                     0x00000001

#define _IEC6_I2C4MIE_POSITION                   0x00000004
#define _IEC6_I2C4MIE_MASK                       0x00000010
#define _IEC6_I2C4MIE_LENGTH                     0x00000001

#define _IEC6_IC10EIE_POSITION                   0x00000005
#define _IEC6_IC10EIE_MASK                       0x00000020
#define _IEC6_IC10EIE_LENGTH                     0x00000001

#define _IEC6_IC10IE_POSITION                    0x00000006
#define _IEC6_IC10IE_MASK                        0x00000040
#define _IEC6_IC10IE_LENGTH                      0x00000001

#define _IEC6_OC10IE_POSITION                    0x00000007
#define _IEC6_OC10IE_MASK                        0x00000080
#define _IEC6_OC10IE_LENGTH                      0x00000001

#define _IEC6_IC11EIE_POSITION                   0x00000008
#define _IEC6_IC11EIE_MASK                       0x00000100
#define _IEC6_IC11EIE_LENGTH                     0x00000001

#define _IEC6_IC11IE_POSITION                    0x00000009
#define _IEC6_IC11IE_MASK                        0x00000200
#define _IEC6_IC11IE_LENGTH                      0x00000001

#define _IEC6_OC11IE_POSITION                    0x0000000A
#define _IEC6_OC11IE_MASK                        0x00000400
#define _IEC6_OC11IE_LENGTH                      0x00000001

