Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk1024gpd100.h
#define _IEC6_IC12EIE_POSITION                   0x0000000B
#define _IEC6_IC12EIE_MASK                       0x00000800
#define _IEC6_IC12EIE_LENGTH                     0x00000001

#define _IEC6_IC12IE_POSITION                    0x0000000C
#define _IEC6_IC12IE_MASK                        0x00001000
#define _IEC6_IC12IE_LENGTH                      0x00000001

#define _IEC6_OC12IE_POSITION                    0x0000000D
#define _IEC6_OC12IE_MASK                        0x00002000
#define _IEC6_OC12IE_LENGTH                      0x00000001

#define _IEC6_IC13EIE_POSITION                   0x0000000E
#define _IEC6_IC13EIE_MASK                       0x00004000
#define _IEC6_IC13EIE_LENGTH                     0x00000001

#define _IEC6_IC13IE_POSITION                    0x0000000F
#define _IEC6_IC13IE_MASK                        0x00008000
#define _IEC6_IC13IE_LENGTH                      0x00000001

#define _IEC6_OC13IE_POSITION                    0x00000010
#define _IEC6_OC13IE_MASK                        0x00010000
#define _IEC6_OC13IE_LENGTH                      0x00000001

#define _IEC6_IC14EIE_POSITION                   0x00000011
#define _IEC6_IC14EIE_MASK                       0x00020000
#define _IEC6_IC14EIE_LENGTH                     0x00000001

#define _IEC6_IC14IE_POSITION                    0x00000012
#define _IEC6_IC14IE_MASK                        0x00040000
#define _IEC6_IC14IE_LENGTH                      0x00000001

#define _IEC6_OC14IE_POSITION                    0x00000013
#define _IEC6_OC14IE_MASK                        0x00080000
#define _IEC6_OC14IE_LENGTH                      0x00000001

#define _IEC6_IC15EIE_POSITION                   0x00000014
#define _IEC6_IC15EIE_MASK                       0x00100000
#define _IEC6_IC15EIE_LENGTH                     0x00000001

#define _IEC6_IC15IE_POSITION                    0x00000015
#define _IEC6_IC15IE_MASK                        0x00200000
#define _IEC6_IC15IE_LENGTH                      0x00000001

#define _IEC6_OC15IE_POSITION                    0x00000016
#define _IEC6_OC15IE_MASK                        0x00400000
#define _IEC6_OC15IE_LENGTH                      0x00000001

#define _IEC6_IC16EIE_POSITION                   0x00000017
#define _IEC6_IC16EIE_MASK                       0x00800000
#define _IEC6_IC16EIE_LENGTH                     0x00000001

#define _IEC6_IC16IE_POSITION                    0x00000018
#define _IEC6_IC16IE_MASK                        0x01000000
#define _IEC6_IC16IE_LENGTH                      0x00000001

#define _IEC6_OC16IE_POSITION                    0x00000019
#define _IEC6_OC16IE_MASK                        0x02000000
#define _IEC6_OC16IE_LENGTH                      0x00000001

#define _IEC6_SPI3EIE_POSITION                   0x0000001A
#define _IEC6_SPI3EIE_MASK                       0x04000000
#define _IEC6_SPI3EIE_LENGTH                     0x00000001

#define _IEC6_SPI3RXIE_POSITION                  0x0000001B
#define _IEC6_SPI3RXIE_MASK                      0x08000000
#define _IEC6_SPI3RXIE_LENGTH                    0x00000001

#define _IEC6_SPI3TXIE_POSITION                  0x0000001C
#define _IEC6_SPI3TXIE_MASK                      0x10000000
#define _IEC6_SPI3TXIE_LENGTH                    0x00000001

#define _IEC6_SPI4EIE_POSITION                   0x0000001D
#define _IEC6_SPI4EIE_MASK                       0x20000000
#define _IEC6_SPI4EIE_LENGTH                     0x00000001

#define _IEC6_SPI4RXIE_POSITION                  0x0000001E
#define _IEC6_SPI4RXIE_MASK                      0x40000000
#define _IEC6_SPI4RXIE_LENGTH                    0x00000001

#define _IEC6_SPI4TXIE_POSITION                  0x0000001F
#define _IEC6_SPI4TXIE_MASK                      0x80000000
#define _IEC6_SPI4TXIE_LENGTH                    0x00000001

#define _IEC6_w_POSITION                         0x00000000
#define _IEC6_w_MASK                             0xFFFFFFFF
#define _IEC6_w_LENGTH                           0x00000020

#define _IEC7_SPI5EIE_POSITION                   0x00000000
#define _IEC7_SPI5EIE_MASK                       0x00000001
#define _IEC7_SPI5EIE_LENGTH                     0x00000001

#define _IEC7_SPI5RXIE_POSITION                  0x00000001
#define _IEC7_SPI5RXIE_MASK                      0x00000002
#define _IEC7_SPI5RXIE_LENGTH                    0x00000001

#define _IEC7_SPI5TXIE_POSITION                  0x00000002
#define _IEC7_SPI5TXIE_MASK                      0x00000004
#define _IEC7_SPI5TXIE_LENGTH                    0x00000001

#define _IEC7_SPI6EIE_POSITION                   0x00000003
#define _IEC7_SPI6EIE_MASK                       0x00000008
#define _IEC7_SPI6EIE_LENGTH                     0x00000001

#define _IEC7_SPI6RXIE_POSITION                  0x00000004
#define _IEC7_SPI6RXIE_MASK                      0x00000010
#define _IEC7_SPI6RXIE_LENGTH                    0x00000001

#define _IEC7_SPI6TXIE_POSITION                  0x00000005
#define _IEC7_SPI6TXIE_MASK                      0x00000020
#define _IEC7_SPI6TXIE_LENGTH                    0x00000001

#define _IEC7_SBIE_POSITION                      0x00000006
#define _IEC7_SBIE_MASK                          0x00000040
#define _IEC7_SBIE_LENGTH                        0x00000001

#define _IEC7_USB2IE_POSITION                    0x00000014
#define _IEC7_USB2IE_MASK                        0x00100000
#define _IEC7_USB2IE_LENGTH                      0x00000001

#define _IEC7_AD1DC3IE_POSITION                  0x00000015
#define _IEC7_AD1DC3IE_MASK                      0x00200000
#define _IEC7_AD1DC3IE_LENGTH                    0x00000001

#define _IEC7_AD1DC4IE_POSITION                  0x00000016
#define _IEC7_AD1DC4IE_MASK                      0x00400000
#define _IEC7_AD1DC4IE_LENGTH                    0x00000001

#define _IEC7_CPCIE_POSITION                     0x0000001E
#define _IEC7_CPCIE_MASK                         0x40000000
#define _IEC7_CPCIE_LENGTH                       0x00000001

#define _IEC7_CFDCIE_POSITION                    0x0000001F
#define _IEC7_CFDCIE_MASK                        0x80000000
#define _IEC7_CFDCIE_LENGTH                      0x00000001

