Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk1024gpd100.h
#define _IPC16_U4EIS_POSITION                    0x00000008
#define _IPC16_U4EIS_MASK                        0x00000300
#define _IPC16_U4EIS_LENGTH                      0x00000002

#define _IPC16_U4EIP_POSITION                    0x0000000A
#define _IPC16_U4EIP_MASK                        0x00001C00
#define _IPC16_U4EIP_LENGTH                      0x00000003

#define _IPC16_U4RXIS_POSITION                   0x00000010
#define _IPC16_U4RXIS_MASK                       0x00030000
#define _IPC16_U4RXIS_LENGTH                     0x00000002

#define _IPC16_U4RXIP_POSITION                   0x00000012
#define _IPC16_U4RXIP_MASK                       0x001C0000
#define _IPC16_U4RXIP_LENGTH                     0x00000003

#define _IPC16_U4TXIS_POSITION                   0x00000018
#define _IPC16_U4TXIS_MASK                       0x03000000
#define _IPC16_U4TXIS_LENGTH                     0x00000002

#define _IPC16_U4TXIP_POSITION                   0x0000001A
#define _IPC16_U4TXIP_MASK                       0x1C000000
#define _IPC16_U4TXIP_LENGTH                     0x00000003

#define _IPC16_w_POSITION                        0x00000000
#define _IPC16_w_MASK                            0xFFFFFFFF
#define _IPC16_w_LENGTH                          0x00000020

#define _IPC17_U5EIS_POSITION                    0x00000000
#define _IPC17_U5EIS_MASK                        0x00000003
#define _IPC17_U5EIS_LENGTH                      0x00000002

#define _IPC17_U5EIP_POSITION                    0x00000002
#define _IPC17_U5EIP_MASK                        0x0000001C
#define _IPC17_U5EIP_LENGTH                      0x00000003

#define _IPC17_U5RXIS_POSITION                   0x00000008
#define _IPC17_U5RXIS_MASK                       0x00000300
#define _IPC17_U5RXIS_LENGTH                     0x00000002

#define _IPC17_U5RXIP_POSITION                   0x0000000A
#define _IPC17_U5RXIP_MASK                       0x00001C00
#define _IPC17_U5RXIP_LENGTH                     0x00000003

#define _IPC17_U5TXIS_POSITION                   0x00000010
#define _IPC17_U5TXIS_MASK                       0x00030000
#define _IPC17_U5TXIS_LENGTH                     0x00000002

#define _IPC17_U5TXIP_POSITION                   0x00000012
#define _IPC17_U5TXIP_MASK                       0x001C0000
#define _IPC17_U5TXIP_LENGTH                     0x00000003

#define _IPC17_CTMUIS_POSITION                   0x00000018
#define _IPC17_CTMUIS_MASK                       0x03000000
#define _IPC17_CTMUIS_LENGTH                     0x00000002

#define _IPC17_CTMUIP_POSITION                   0x0000001A
#define _IPC17_CTMUIP_MASK                       0x1C000000
#define _IPC17_CTMUIP_LENGTH                     0x00000003

#define _IPC17_w_POSITION                        0x00000000
#define _IPC17_w_MASK                            0xFFFFFFFF
#define _IPC17_w_LENGTH                          0x00000020

#define _IPC18_DMA0IS_POSITION                   0x00000000
#define _IPC18_DMA0IS_MASK                       0x00000003
#define _IPC18_DMA0IS_LENGTH                     0x00000002

#define _IPC18_DMA0IP_POSITION                   0x00000002
#define _IPC18_DMA0IP_MASK                       0x0000001C
#define _IPC18_DMA0IP_LENGTH                     0x00000003

#define _IPC18_DMA1IS_POSITION                   0x00000008
#define _IPC18_DMA1IS_MASK                       0x00000300
#define _IPC18_DMA1IS_LENGTH                     0x00000002

#define _IPC18_DMA1IP_POSITION                   0x0000000A
#define _IPC18_DMA1IP_MASK                       0x00001C00
#define _IPC18_DMA1IP_LENGTH                     0x00000003

#define _IPC18_DMA2IS_POSITION                   0x00000010
#define _IPC18_DMA2IS_MASK                       0x00030000
#define _IPC18_DMA2IS_LENGTH                     0x00000002

#define _IPC18_DMA2IP_POSITION                   0x00000012
#define _IPC18_DMA2IP_MASK                       0x001C0000
#define _IPC18_DMA2IP_LENGTH                     0x00000003

#define _IPC18_DMA3IS_POSITION                   0x00000018
#define _IPC18_DMA3IS_MASK                       0x03000000
#define _IPC18_DMA3IS_LENGTH                     0x00000002

#define _IPC18_DMA3IP_POSITION                   0x0000001A
#define _IPC18_DMA3IP_MASK                       0x1C000000
#define _IPC18_DMA3IP_LENGTH                     0x00000003

#define _IPC18_w_POSITION                        0x00000000
#define _IPC18_w_MASK                            0xFFFFFFFF
#define _IPC18_w_LENGTH                          0x00000020

#define _IPC19_T6IS_POSITION                     0x00000000
#define _IPC19_T6IS_MASK                         0x00000003
#define _IPC19_T6IS_LENGTH                       0x00000002

#define _IPC19_T6IP_POSITION                     0x00000002
#define _IPC19_T6IP_MASK                         0x0000001C
#define _IPC19_T6IP_LENGTH                       0x00000003

#define _IPC19_IC6EIS_POSITION                   0x00000008
#define _IPC19_IC6EIS_MASK                       0x00000300
#define _IPC19_IC6EIS_LENGTH                     0x00000002

#define _IPC19_IC6EIP_POSITION                   0x0000000A
#define _IPC19_IC6EIP_MASK                       0x00001C00
#define _IPC19_IC6EIP_LENGTH                     0x00000003

#define _IPC19_IC6IS_POSITION                    0x00000010
#define _IPC19_IC6IS_MASK                        0x00030000
#define _IPC19_IC6IS_LENGTH                      0x00000002

#define _IPC19_IC6IP_POSITION                    0x00000012
#define _IPC19_IC6IP_MASK                        0x001C0000
#define _IPC19_IC6IP_LENGTH                      0x00000003

#define _IPC19_OC6IS_POSITION                    0x00000018
#define _IPC19_OC6IS_MASK                        0x03000000
#define _IPC19_OC6IS_LENGTH                      0x00000002

#define _IPC19_OC6IP_POSITION                    0x0000001A
#define _IPC19_OC6IP_MASK                        0x1C000000
#define _IPC19_OC6IP_LENGTH                      0x00000003

#define _IPC19_w_POSITION                        0x00000000
#define _IPC19_w_MASK                            0xFFFFFFFF
#define _IPC19_w_LENGTH                          0x00000020

