Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk1024gpd100.h
#define _OFF022_VOFF_POSITION                    0x00000001
#define _OFF022_VOFF_MASK                        0x0003FFFE
#define _OFF022_VOFF_LENGTH                      0x00000011

#define _OFF023_VOFF_POSITION                    0x00000001
#define _OFF023_VOFF_MASK                        0x0003FFFE
#define _OFF023_VOFF_LENGTH                      0x00000011

#define _OFF024_VOFF_POSITION                    0x00000001
#define _OFF024_VOFF_MASK                        0x0003FFFE
#define _OFF024_VOFF_LENGTH                      0x00000011

#define _OFF025_VOFF_POSITION                    0x00000001
#define _OFF025_VOFF_MASK                        0x0003FFFE
#define _OFF025_VOFF_LENGTH                      0x00000011

#define _OFF026_VOFF_POSITION                    0x00000001
#define _OFF026_VOFF_MASK                        0x0003FFFE
#define _OFF026_VOFF_LENGTH                      0x00000011

#define _OFF027_VOFF_POSITION                    0x00000001
#define _OFF027_VOFF_MASK                        0x0003FFFE
#define _OFF027_VOFF_LENGTH                      0x00000011

#define _OFF030_VOFF_POSITION                    0x00000001
#define _OFF030_VOFF_MASK                        0x0003FFFE
#define _OFF030_VOFF_LENGTH                      0x00000011

#define _OFF031_VOFF_POSITION                    0x00000001
#define _OFF031_VOFF_MASK                        0x0003FFFE
#define _OFF031_VOFF_LENGTH                      0x00000011

#define _OFF032_VOFF_POSITION                    0x00000001
#define _OFF032_VOFF_MASK                        0x0003FFFE
#define _OFF032_VOFF_LENGTH                      0x00000011

#define _OFF033_VOFF_POSITION                    0x00000001
#define _OFF033_VOFF_MASK                        0x0003FFFE
#define _OFF033_VOFF_LENGTH                      0x00000011

#define _OFF034_VOFF_POSITION                    0x00000001
#define _OFF034_VOFF_MASK                        0x0003FFFE
#define _OFF034_VOFF_LENGTH                      0x00000011

#define _OFF035_VOFF_POSITION                    0x00000001
#define _OFF035_VOFF_MASK                        0x0003FFFE
#define _OFF035_VOFF_LENGTH                      0x00000011

#define _OFF036_VOFF_POSITION                    0x00000001
#define _OFF036_VOFF_MASK                        0x0003FFFE
#define _OFF036_VOFF_LENGTH                      0x00000011

#define _OFF037_VOFF_POSITION                    0x00000001
#define _OFF037_VOFF_MASK                        0x0003FFFE
#define _OFF037_VOFF_LENGTH                      0x00000011

#define _OFF038_VOFF_POSITION                    0x00000001
#define _OFF038_VOFF_MASK                        0x0003FFFE
#define _OFF038_VOFF_LENGTH                      0x00000011

#define _OFF039_VOFF_POSITION                    0x00000001
#define _OFF039_VOFF_MASK                        0x0003FFFE
#define _OFF039_VOFF_LENGTH                      0x00000011

#define _OFF040_VOFF_POSITION                    0x00000001
#define _OFF040_VOFF_MASK                        0x0003FFFE
#define _OFF040_VOFF_LENGTH                      0x00000011

#define _OFF041_VOFF_POSITION                    0x00000001
#define _OFF041_VOFF_MASK                        0x0003FFFE
#define _OFF041_VOFF_LENGTH                      0x00000011

#define _OFF042_VOFF_POSITION                    0x00000001
#define _OFF042_VOFF_MASK                        0x0003FFFE
#define _OFF042_VOFF_LENGTH                      0x00000011

#define _OFF043_VOFF_POSITION                    0x00000001
#define _OFF043_VOFF_MASK                        0x0003FFFE
#define _OFF043_VOFF_LENGTH                      0x00000011

#define _OFF044_VOFF_POSITION                    0x00000001
#define _OFF044_VOFF_MASK                        0x0003FFFE
#define _OFF044_VOFF_LENGTH                      0x00000011

#define _OFF045_VOFF_POSITION                    0x00000001
#define _OFF045_VOFF_MASK                        0x0003FFFE
#define _OFF045_VOFF_LENGTH                      0x00000011

#define _OFF046_VOFF_POSITION                    0x00000001
#define _OFF046_VOFF_MASK                        0x0003FFFE
#define _OFF046_VOFF_LENGTH                      0x00000011

#define _OFF047_VOFF_POSITION                    0x00000001
#define _OFF047_VOFF_MASK                        0x0003FFFE
#define _OFF047_VOFF_LENGTH                      0x00000011

#define _OFF048_VOFF_POSITION                    0x00000001
#define _OFF048_VOFF_MASK                        0x0003FFFE
#define _OFF048_VOFF_LENGTH                      0x00000011

#define _OFF049_VOFF_POSITION                    0x00000001
#define _OFF049_VOFF_MASK                        0x0003FFFE
#define _OFF049_VOFF_LENGTH                      0x00000011

#define _OFF050_VOFF_POSITION                    0x00000001
#define _OFF050_VOFF_MASK                        0x0003FFFE
#define _OFF050_VOFF_LENGTH                      0x00000011

#define _OFF051_VOFF_POSITION                    0x00000001
#define _OFF051_VOFF_MASK                        0x0003FFFE
#define _OFF051_VOFF_LENGTH                      0x00000011

#define _OFF052_VOFF_POSITION                    0x00000001
#define _OFF052_VOFF_MASK                        0x0003FFFE
#define _OFF052_VOFF_LENGTH                      0x00000011

#define _OFF053_VOFF_POSITION                    0x00000001
#define _OFF053_VOFF_MASK                        0x0003FFFE
#define _OFF053_VOFF_LENGTH                      0x00000011

#define _OFF054_VOFF_POSITION                    0x00000001
#define _OFF054_VOFF_MASK                        0x0003FFFE
#define _OFF054_VOFF_LENGTH                      0x00000011

#define _OFF055_VOFF_POSITION                    0x00000001
#define _OFF055_VOFF_MASK                        0x0003FFFE
#define _OFF055_VOFF_LENGTH                      0x00000011

#define _OFF056_VOFF_POSITION                    0x00000001
#define _OFF056_VOFF_MASK                        0x0003FFFE
#define _OFF056_VOFF_LENGTH                      0x00000011

#define _OFF057_VOFF_POSITION                    0x00000001
#define _OFF057_VOFF_MASK                        0x0003FFFE
#define _OFF057_VOFF_LENGTH                      0x00000011

#define _OFF058_VOFF_POSITION                    0x00000001
#define _OFF058_VOFF_MASK                        0x0003FFFE
#define _OFF058_VOFF_LENGTH                      0x00000011

#define _OFF059_VOFF_POSITION                    0x00000001
#define _OFF059_VOFF_MASK                        0x0003FFFE
#define _OFF059_VOFF_LENGTH                      0x00000011

