Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk1024gpd100.h
#define _OFF139_VOFF_POSITION                    0x00000001
#define _OFF139_VOFF_MASK                        0x0003FFFE
#define _OFF139_VOFF_LENGTH                      0x00000011

#define _OFF140_VOFF_POSITION                    0x00000001
#define _OFF140_VOFF_MASK                        0x0003FFFE
#define _OFF140_VOFF_LENGTH                      0x00000011

#define _OFF141_VOFF_POSITION                    0x00000001
#define _OFF141_VOFF_MASK                        0x0003FFFE
#define _OFF141_VOFF_LENGTH                      0x00000011

#define _OFF142_VOFF_POSITION                    0x00000001
#define _OFF142_VOFF_MASK                        0x0003FFFE
#define _OFF142_VOFF_LENGTH                      0x00000011

#define _OFF143_VOFF_POSITION                    0x00000001
#define _OFF143_VOFF_MASK                        0x0003FFFE
#define _OFF143_VOFF_LENGTH                      0x00000011

#define _OFF144_VOFF_POSITION                    0x00000001
#define _OFF144_VOFF_MASK                        0x0003FFFE
#define _OFF144_VOFF_LENGTH                      0x00000011

#define _OFF145_VOFF_POSITION                    0x00000001
#define _OFF145_VOFF_MASK                        0x0003FFFE
#define _OFF145_VOFF_LENGTH                      0x00000011

#define _OFF146_VOFF_POSITION                    0x00000001
#define _OFF146_VOFF_MASK                        0x0003FFFE
#define _OFF146_VOFF_LENGTH                      0x00000011

#define _OFF147_VOFF_POSITION                    0x00000001
#define _OFF147_VOFF_MASK                        0x0003FFFE
#define _OFF147_VOFF_LENGTH                      0x00000011

#define _OFF151_VOFF_POSITION                    0x00000001
#define _OFF151_VOFF_MASK                        0x0003FFFE
#define _OFF151_VOFF_LENGTH                      0x00000011

#define _OFF152_VOFF_POSITION                    0x00000001
#define _OFF152_VOFF_MASK                        0x0003FFFE
#define _OFF152_VOFF_LENGTH                      0x00000011

#define _OFF153_VOFF_POSITION                    0x00000001
#define _OFF153_VOFF_MASK                        0x0003FFFE
#define _OFF153_VOFF_LENGTH                      0x00000011

#define _OFF154_VOFF_POSITION                    0x00000001
#define _OFF154_VOFF_MASK                        0x0003FFFE
#define _OFF154_VOFF_LENGTH                      0x00000011

#define _OFF155_VOFF_POSITION                    0x00000001
#define _OFF155_VOFF_MASK                        0x0003FFFE
#define _OFF155_VOFF_LENGTH                      0x00000011

#define _OFF156_VOFF_POSITION                    0x00000001
#define _OFF156_VOFF_MASK                        0x0003FFFE
#define _OFF156_VOFF_LENGTH                      0x00000011

#define _OFF157_VOFF_POSITION                    0x00000001
#define _OFF157_VOFF_MASK                        0x0003FFFE
#define _OFF157_VOFF_LENGTH                      0x00000011

#define _OFF158_VOFF_POSITION                    0x00000001
#define _OFF158_VOFF_MASK                        0x0003FFFE
#define _OFF158_VOFF_LENGTH                      0x00000011

#define _OFF159_VOFF_POSITION                    0x00000001
#define _OFF159_VOFF_MASK                        0x0003FFFE
#define _OFF159_VOFF_LENGTH                      0x00000011

#define _OFF160_VOFF_POSITION                    0x00000001
#define _OFF160_VOFF_MASK                        0x0003FFFE
#define _OFF160_VOFF_LENGTH                      0x00000011

#define _OFF161_VOFF_POSITION                    0x00000001
#define _OFF161_VOFF_MASK                        0x0003FFFE
#define _OFF161_VOFF_LENGTH                      0x00000011

#define _OFF162_VOFF_POSITION                    0x00000001
#define _OFF162_VOFF_MASK                        0x0003FFFE
#define _OFF162_VOFF_LENGTH                      0x00000011

#define _OFF164_VOFF_POSITION                    0x00000001
#define _OFF164_VOFF_MASK                        0x0003FFFE
#define _OFF164_VOFF_LENGTH                      0x00000011

#define _OFF165_VOFF_POSITION                    0x00000001
#define _OFF165_VOFF_MASK                        0x0003FFFE
#define _OFF165_VOFF_LENGTH                      0x00000011

#define _OFF166_VOFF_POSITION                    0x00000001
#define _OFF166_VOFF_MASK                        0x0003FFFE
#define _OFF166_VOFF_LENGTH                      0x00000011

#define _OFF179_VOFF_POSITION                    0x00000001
#define _OFF179_VOFF_MASK                        0x0003FFFE
#define _OFF179_VOFF_LENGTH                      0x00000011

#define _OFF180_VOFF_POSITION                    0x00000001
#define _OFF180_VOFF_MASK                        0x0003FFFE
#define _OFF180_VOFF_LENGTH                      0x00000011

#define _OFF181_VOFF_POSITION                    0x00000001
#define _OFF181_VOFF_MASK                        0x0003FFFE
#define _OFF181_VOFF_LENGTH                      0x00000011

#define _OFF182_VOFF_POSITION                    0x00000001
#define _OFF182_VOFF_MASK                        0x0003FFFE
#define _OFF182_VOFF_LENGTH                      0x00000011

#define _OFF183_VOFF_POSITION                    0x00000001
#define _OFF183_VOFF_MASK                        0x0003FFFE
#define _OFF183_VOFF_LENGTH                      0x00000011

#define _OFF184_VOFF_POSITION                    0x00000001
#define _OFF184_VOFF_MASK                        0x0003FFFE
#define _OFF184_VOFF_LENGTH                      0x00000011

#define _OFF185_VOFF_POSITION                    0x00000001
#define _OFF185_VOFF_MASK                        0x0003FFFE
#define _OFF185_VOFF_LENGTH                      0x00000011

#define _OFF186_VOFF_POSITION                    0x00000001
#define _OFF186_VOFF_MASK                        0x0003FFFE
#define _OFF186_VOFF_LENGTH                      0x00000011

#define _OFF194_VOFF_POSITION                    0x00000001
#define _OFF194_VOFF_MASK                        0x0003FFFE
#define _OFF194_VOFF_LENGTH                      0x00000011

#define _OFF195_VOFF_POSITION                    0x00000001
#define _OFF195_VOFF_MASK                        0x0003FFFE
#define _OFF195_VOFF_LENGTH                      0x00000011

#define _OFF196_VOFF_POSITION                    0x00000001
#define _OFF196_VOFF_MASK                        0x0003FFFE
#define _OFF196_VOFF_LENGTH                      0x00000011

#define _OFF197_VOFF_POSITION                    0x00000001
#define _OFF197_VOFF_MASK                        0x0003FFFE
#define _OFF197_VOFF_LENGTH                      0x00000011

