Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk1024gpd100.h
#define _CNSTATE_CNSTATE12_POSITION              0x0000000C
#define _CNSTATE_CNSTATE12_MASK                  0x00001000
#define _CNSTATE_CNSTATE12_LENGTH                0x00000001

#define _CNSTATE_CNSTATE13_POSITION              0x0000000D
#define _CNSTATE_CNSTATE13_MASK                  0x00002000
#define _CNSTATE_CNSTATE13_LENGTH                0x00000001

#define _CNSTATE_CNSTATE14_POSITION              0x0000000E
#define _CNSTATE_CNSTATE14_MASK                  0x00004000
#define _CNSTATE_CNSTATE14_LENGTH                0x00000001

#define _CNSTATE_CNSTATE15_POSITION              0x0000000F
#define _CNSTATE_CNSTATE15_MASK                  0x00008000
#define _CNSTATE_CNSTATE15_LENGTH                0x00000001

#define _CNSTATE_w_POSITION                      0x00000000
#define _CNSTATE_w_MASK                          0xFFFFFFFF
#define _CNSTATE_w_LENGTH                        0x00000020

#define _CNNEE_CNNEE0_POSITION                   0x00000000
#define _CNNEE_CNNEE0_MASK                       0x00000001
#define _CNNEE_CNNEE0_LENGTH                     0x00000001

#define _CNNEE_CNNEE1_POSITION                   0x00000001
#define _CNNEE_CNNEE1_MASK                       0x00000002
#define _CNNEE_CNNEE1_LENGTH                     0x00000001

#define _CNNEE_CNNEE8_POSITION                   0x00000008
#define _CNNEE_CNNEE8_MASK                       0x00000100
#define _CNNEE_CNNEE8_LENGTH                     0x00000001

#define _CNNEE_CNNEE9_POSITION                   0x00000009
#define _CNNEE_CNNEE9_MASK                       0x00000200
#define _CNNEE_CNNEE9_LENGTH                     0x00000001

#define _CNNEE_CNNEE12_POSITION                  0x0000000C
#define _CNNEE_CNNEE12_MASK                      0x00001000
#define _CNNEE_CNNEE12_LENGTH                    0x00000001

#define _CNNEE_CNNEE13_POSITION                  0x0000000D
#define _CNNEE_CNNEE13_MASK                      0x00002000
#define _CNNEE_CNNEE13_LENGTH                    0x00000001

#define _CNNEE_CNNEE14_POSITION                  0x0000000E
#define _CNNEE_CNNEE14_MASK                      0x00004000
#define _CNNEE_CNNEE14_LENGTH                    0x00000001

#define _CNNEE_CNNEE15_POSITION                  0x0000000F
#define _CNNEE_CNNEE15_MASK                      0x00008000
#define _CNNEE_CNNEE15_LENGTH                    0x00000001

#define _CNFE_CNFE0_POSITION                     0x00000000
#define _CNFE_CNFE0_MASK                         0x00000001
#define _CNFE_CNFE0_LENGTH                       0x00000001

#define _CNFE_CNFE1_POSITION                     0x00000001
#define _CNFE_CNFE1_MASK                         0x00000002
#define _CNFE_CNFE1_LENGTH                       0x00000001

#define _CNFE_CNFE8_POSITION                     0x00000008
#define _CNFE_CNFE8_MASK                         0x00000100
#define _CNFE_CNFE8_LENGTH                       0x00000001

#define _CNFE_CNFE9_POSITION                     0x00000009
#define _CNFE_CNFE9_MASK                         0x00000200
#define _CNFE_CNFE9_LENGTH                       0x00000001

#define _CNFE_CNFE12_POSITION                    0x0000000C
#define _CNFE_CNFE12_MASK                        0x00001000
#define _CNFE_CNFE12_LENGTH                      0x00000001

#define _CNFE_CNFE13_POSITION                    0x0000000D
#define _CNFE_CNFE13_MASK                        0x00002000
#define _CNFE_CNFE13_LENGTH                      0x00000001

#define _CNFE_CNFE14_POSITION                    0x0000000E
#define _CNFE_CNFE14_MASK                        0x00004000
#define _CNFE_CNFE14_LENGTH                      0x00000001

#define _CNFE_CNFE15_POSITION                    0x0000000F
#define _CNFE_CNFE15_MASK                        0x00008000
#define _CNFE_CNFE15_LENGTH                      0x00000001

#define _SRCON0E_SR0E12_POSITION                 0x0000000C
#define _SRCON0E_SR0E12_MASK                     0x00001000
#define _SRCON0E_SR0E12_LENGTH                   0x00000001

#define _SRCON0E_SR0E13_POSITION                 0x0000000D
#define _SRCON0E_SR0E13_MASK                     0x00002000
#define _SRCON0E_SR0E13_LENGTH                   0x00000001

#define _SRCON0E_SR0E14_POSITION                 0x0000000E
#define _SRCON0E_SR0E14_MASK                     0x00004000
#define _SRCON0E_SR0E14_LENGTH                   0x00000001

#define _SRCON0E_SR0E15_POSITION                 0x0000000F
#define _SRCON0E_SR0E15_MASK                     0x00008000
#define _SRCON0E_SR0E15_LENGTH                   0x00000001

#define _SRCON1E_SR1E12_POSITION                 0x0000000C
#define _SRCON1E_SR1E12_MASK                     0x00001000
#define _SRCON1E_SR1E12_LENGTH                   0x00000001

#define _SRCON1E_SR1E13_POSITION                 0x0000000D
#define _SRCON1E_SR1E13_MASK                     0x00002000
#define _SRCON1E_SR1E13_LENGTH                   0x00000001

#define _SRCON1E_SR1E14_POSITION                 0x0000000E
#define _SRCON1E_SR1E14_MASK                     0x00004000
#define _SRCON1E_SR1E14_LENGTH                   0x00000001

#define _SRCON1E_SR1E15_POSITION                 0x0000000F
#define _SRCON1E_SR1E15_MASK                     0x00008000
#define _SRCON1E_SR1E15_LENGTH                   0x00000001

#define _ANSELF_ANSF5_POSITION                   0x00000005
#define _ANSELF_ANSF5_MASK                       0x00000020
#define _ANSELF_ANSF5_LENGTH                     0x00000001

#define _ANSELF_ANSF9_POSITION                   0x00000009
#define _ANSELF_ANSF9_MASK                       0x00000200
#define _ANSELF_ANSF9_LENGTH                     0x00000001

#define _ANSELF_ANSF10_POSITION                  0x0000000A
#define _ANSELF_ANSF10_MASK                      0x00000400
#define _ANSELF_ANSF10_LENGTH                    0x00000001

#define _ANSELF_ANSF12_POSITION                  0x0000000C
#define _ANSELF_ANSF12_MASK                      0x00001000
#define _ANSELF_ANSF12_LENGTH                    0x00000001

#define _ANSELF_ANSF13_POSITION                  0x0000000D
#define _ANSELF_ANSF13_MASK                      0x00002000
#define _ANSELF_ANSF13_LENGTH                    0x00000001

#define _ANSELF_w_POSITION                       0x00000000
#define _ANSELF_w_MASK                           0xFFFFFFFF
#define _ANSELF_w_LENGTH                         0x00000020

#define _TRISF_TRISF0_POSITION                   0x00000000
#define _TRISF_TRISF0_MASK                       0x00000001
#define _TRISF_TRISF0_LENGTH                     0x00000001

#define _TRISF_TRISF1_POSITION                   0x00000001
#define _TRISF_TRISF1_MASK                       0x00000002
#define _TRISF_TRISF1_LENGTH                     0x00000001

#define _TRISF_TRISF5_POSITION                   0x00000005
#define _TRISF_TRISF5_MASK                       0x00000020
#define _TRISF_TRISF5_LENGTH                     0x00000001

