Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk1024gpd100.h
#define _ADCDATA11_DATA_POSITION                 0x00000000
#define _ADCDATA11_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA11_DATA_LENGTH                   0x00000020

#define _ADCDATA12_DATA_POSITION                 0x00000000
#define _ADCDATA12_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA12_DATA_LENGTH                   0x00000020

#define _ADCDATA13_DATA_POSITION                 0x00000000
#define _ADCDATA13_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA13_DATA_LENGTH                   0x00000020

#define _ADCDATA14_DATA_POSITION                 0x00000000
#define _ADCDATA14_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA14_DATA_LENGTH                   0x00000020

#define _ADCDATA15_DATA_POSITION                 0x00000000
#define _ADCDATA15_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA15_DATA_LENGTH                   0x00000020

#define _ADCDATA16_DATA_POSITION                 0x00000000
#define _ADCDATA16_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA16_DATA_LENGTH                   0x00000020

#define _ADCDATA17_DATA_POSITION                 0x00000000
#define _ADCDATA17_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA17_DATA_LENGTH                   0x00000020

#define _ADCDATA18_DATA_POSITION                 0x00000000
#define _ADCDATA18_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA18_DATA_LENGTH                   0x00000020

#define _ADCDATA19_DATA_POSITION                 0x00000000
#define _ADCDATA19_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA19_DATA_LENGTH                   0x00000020

#define _ADCDATA20_DATA_POSITION                 0x00000000
#define _ADCDATA20_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA20_DATA_LENGTH                   0x00000020

#define _ADCDATA21_DATA_POSITION                 0x00000000
#define _ADCDATA21_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA21_DATA_LENGTH                   0x00000020

#define _ADCDATA22_DATA_POSITION                 0x00000000
#define _ADCDATA22_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA22_DATA_LENGTH                   0x00000020

#define _ADCDATA23_DATA_POSITION                 0x00000000
#define _ADCDATA23_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA23_DATA_LENGTH                   0x00000020

#define _ADCDATA24_DATA_POSITION                 0x00000000
#define _ADCDATA24_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA24_DATA_LENGTH                   0x00000020

#define _ADCDATA25_DATA_POSITION                 0x00000000
#define _ADCDATA25_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA25_DATA_LENGTH                   0x00000020

#define _ADCDATA26_DATA_POSITION                 0x00000000
#define _ADCDATA26_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA26_DATA_LENGTH                   0x00000020

#define _ADCDATA27_DATA_POSITION                 0x00000000
#define _ADCDATA27_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA27_DATA_LENGTH                   0x00000020

#define _ADCDATA33_DATA_POSITION                 0x00000000
#define _ADCDATA33_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA33_DATA_LENGTH                   0x00000020

#define _ADCDATA34_DATA_POSITION                 0x00000000
#define _ADCDATA34_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA34_DATA_LENGTH                   0x00000020

#define _ADCDATA35_DATA_POSITION                 0x00000000
#define _ADCDATA35_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA35_DATA_LENGTH                   0x00000020

#define _ADCDATA36_DATA_POSITION                 0x00000000
#define _ADCDATA36_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA36_DATA_LENGTH                   0x00000020

#define _ADCDATA37_DATA_POSITION                 0x00000000
#define _ADCDATA37_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA37_DATA_LENGTH                   0x00000020

#define _ADCDATA38_DATA_POSITION                 0x00000000
#define _ADCDATA38_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA38_DATA_LENGTH                   0x00000020

#define _ADCDATA39_DATA_POSITION                 0x00000000
#define _ADCDATA39_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA39_DATA_LENGTH                   0x00000020

#define _ADCDATA40_DATA_POSITION                 0x00000000
#define _ADCDATA40_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA40_DATA_LENGTH                   0x00000020

#define _ADCDATA41_DATA_POSITION                 0x00000000
#define _ADCDATA41_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA41_DATA_LENGTH                   0x00000020

#define _ADCDATA45_DATA_POSITION                 0x00000000
#define _ADCDATA45_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA45_DATA_LENGTH                   0x00000020

#define _ADCDATA46_DATA_POSITION                 0x00000000
#define _ADCDATA46_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA46_DATA_LENGTH                   0x00000020

#define _ADCDATA47_DATA_POSITION                 0x00000000
#define _ADCDATA47_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA47_DATA_LENGTH                   0x00000020

#define _ADCDATA48_DATA_POSITION                 0x00000000
#define _ADCDATA48_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA48_DATA_LENGTH                   0x00000020

#define _ADCDATA49_DATA_POSITION                 0x00000000
#define _ADCDATA49_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA49_DATA_LENGTH                   0x00000020

#define _ADCDATA50_DATA_POSITION                 0x00000000
#define _ADCDATA50_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA50_DATA_LENGTH                   0x00000020

#define _ADCDATA51_DATA_POSITION                 0x00000000
#define _ADCDATA51_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA51_DATA_LENGTH                   0x00000020

#define _ADCDATA52_DATA_POSITION                 0x00000000
#define _ADCDATA52_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA52_DATA_LENGTH                   0x00000020

