Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk1024gpd100.h
#define _BF2DEVCFG1_WINDIS_POSITION              0x00000016
#define _BF2DEVCFG1_WINDIS_MASK                  0x00400000
#define _BF2DEVCFG1_WINDIS_LENGTH                0x00000001

#define _BF2DEVCFG1_FWDTEN_POSITION              0x00000017
#define _BF2DEVCFG1_FWDTEN_MASK                  0x00800000
#define _BF2DEVCFG1_FWDTEN_LENGTH                0x00000001

#define _BF2DEVCFG1_FWDTWINSZ_POSITION           0x00000018
#define _BF2DEVCFG1_FWDTWINSZ_MASK               0x03000000
#define _BF2DEVCFG1_FWDTWINSZ_LENGTH             0x00000002

#define _BF2DEVCFG1_DMTCNT_POSITION              0x0000001A
#define _BF2DEVCFG1_DMTCNT_MASK                  0x7C000000
#define _BF2DEVCFG1_DMTCNT_LENGTH                0x00000005

#define _BF2DEVCFG1_FDMTEN_POSITION              0x0000001F
#define _BF2DEVCFG1_FDMTEN_MASK                  0x80000000
#define _BF2DEVCFG1_FDMTEN_LENGTH                0x00000001

#define _BF2DEVCFG1_w_POSITION                   0x00000000
#define _BF2DEVCFG1_w_MASK                       0xFFFFFFFF
#define _BF2DEVCFG1_w_LENGTH                     0x00000020

#define _BF2DEVCFG0_DEBUG_POSITION               0x00000000
#define _BF2DEVCFG0_DEBUG_MASK                   0x00000003
#define _BF2DEVCFG0_DEBUG_LENGTH                 0x00000002

#define _BF2DEVCFG0_JTAGEN_POSITION              0x00000002
#define _BF2DEVCFG0_JTAGEN_MASK                  0x00000004
#define _BF2DEVCFG0_JTAGEN_LENGTH                0x00000001

#define _BF2DEVCFG0_ICESEL_POSITION              0x00000003
#define _BF2DEVCFG0_ICESEL_MASK                  0x00000018
#define _BF2DEVCFG0_ICESEL_LENGTH                0x00000002

#define _BF2DEVCFG0_TRCEN_POSITION               0x00000005
#define _BF2DEVCFG0_TRCEN_MASK                   0x00000020
#define _BF2DEVCFG0_TRCEN_LENGTH                 0x00000001

#define _BF2DEVCFG0_BOOTISA_POSITION             0x00000006
#define _BF2DEVCFG0_BOOTISA_MASK                 0x00000040
#define _BF2DEVCFG0_BOOTISA_LENGTH               0x00000001

#define _BF2DEVCFG0_FSLEEP_POSITION              0x0000000A
#define _BF2DEVCFG0_FSLEEP_MASK                  0x00000400
#define _BF2DEVCFG0_FSLEEP_LENGTH                0x00000001

#define _BF2DEVCFG0_DBGPER_POSITION              0x0000000C
#define _BF2DEVCFG0_DBGPER_MASK                  0x00007000
#define _BF2DEVCFG0_DBGPER_LENGTH                0x00000003

#define _BF2DEVCFG0_SMCLR_POSITION               0x0000000F
#define _BF2DEVCFG0_SMCLR_MASK                   0x00008000
#define _BF2DEVCFG0_SMCLR_LENGTH                 0x00000001

#define _BF2DEVCFG0_SOSCGAIN_POSITION            0x00000010
#define _BF2DEVCFG0_SOSCGAIN_MASK                0x00030000
#define _BF2DEVCFG0_SOSCGAIN_LENGTH              0x00000002

#define _BF2DEVCFG0_SOSCBOOST_POSITION           0x00000012
#define _BF2DEVCFG0_SOSCBOOST_MASK               0x00040000
#define _BF2DEVCFG0_SOSCBOOST_LENGTH             0x00000001

#define _BF2DEVCFG0_POSCGAIN_POSITION            0x00000013
#define _BF2DEVCFG0_POSCGAIN_MASK                0x00180000
#define _BF2DEVCFG0_POSCGAIN_LENGTH              0x00000002

#define _BF2DEVCFG0_POSCBOOST_POSITION           0x00000015
#define _BF2DEVCFG0_POSCBOOST_MASK               0x00200000
#define _BF2DEVCFG0_POSCBOOST_LENGTH             0x00000001

#define _BF2DEVCFG0_EJTAGBEN_POSITION            0x0000001E
#define _BF2DEVCFG0_EJTAGBEN_MASK                0x40000000
#define _BF2DEVCFG0_EJTAGBEN_LENGTH              0x00000001

#define _BF2DEVCFG0_FDEBUG_POSITION              0x00000000
#define _BF2DEVCFG0_FDEBUG_MASK                  0x00000003
#define _BF2DEVCFG0_FDEBUG_LENGTH                0x00000002

#define _BF2DEVCFG0_w_POSITION                   0x00000000
#define _BF2DEVCFG0_w_MASK                       0xFFFFFFFF
#define _BF2DEVCFG0_w_LENGTH                     0x00000020

#define _BF2DEVCP_CP_POSITION                    0x0000001C
#define _BF2DEVCP_CP_MASK                        0x10000000
#define _BF2DEVCP_CP_LENGTH                      0x00000001

#define _BF2DEVCP_w_POSITION                     0x00000000
#define _BF2DEVCP_w_MASK                         0xFFFFFFFF
#define _BF2DEVCP_w_LENGTH                       0x00000020

#define _BF2SEQ_TSEQ_POSITION                    0x00000000
#define _BF2SEQ_TSEQ_MASK                        0x0000FFFF
#define _BF2SEQ_TSEQ_LENGTH                      0x00000010

#define _BF2SEQ_CSEQ_POSITION                    0x00000010
#define _BF2SEQ_CSEQ_MASK                        0xFFFF0000
#define _BF2SEQ_CSEQ_LENGTH                      0x00000010

#define _BF2SEQ_w_POSITION                       0x00000000
#define _BF2SEQ_w_MASK                           0xFFFFFFFF
#define _BF2SEQ_w_LENGTH                         0x00000020

/* Vector Numbers */
#define _CORE_TIMER_VECTOR                       0
#define _CORE_SOFTWARE_0_VECTOR                  1
#define _CORE_SOFTWARE_1_VECTOR                  2
#define _EXTERNAL_0_VECTOR                       3
#define _TIMER_1_VECTOR                          4
#define _INPUT_CAPTURE_1_ERROR_VECTOR            5
#define _INPUT_CAPTURE_1_VECTOR                  6
#define _OUTPUT_COMPARE_1_VECTOR                 7
#define _EXTERNAL_1_VECTOR                       8
#define _TIMER_2_VECTOR                          9
#define _INPUT_CAPTURE_2_ERROR_VECTOR            10
#define _INPUT_CAPTURE_2_VECTOR                  11
#define _OUTPUT_COMPARE_2_VECTOR                 12
#define _EXTERNAL_2_VECTOR                       13
#define _TIMER_3_VECTOR                          14
#define _INPUT_CAPTURE_3_ERROR_VECTOR            15
#define _INPUT_CAPTURE_3_VECTOR                  16
#define _OUTPUT_COMPARE_3_VECTOR                 17
#define _EXTERNAL_3_VECTOR                       18
#define _TIMER_4_VECTOR                          19
#define _INPUT_CAPTURE_4_ERROR_VECTOR            20
#define _INPUT_CAPTURE_4_VECTOR                  21
#define _OUTPUT_COMPARE_4_VECTOR                 22
#define _EXTERNAL_4_VECTOR                       23
#define _TIMER_5_VECTOR                          24
#define _INPUT_CAPTURE_5_ERROR_VECTOR            25
#define _INPUT_CAPTURE_5_VECTOR                  26
#define _OUTPUT_COMPARE_5_VECTOR                 27
#define _RTCC_VECTOR                             30
#define _FLASH_CONTROL_VECTOR                    31
#define _COMPARATOR_1_VECTOR                     32
#define _COMPARATOR_2_VECTOR                     33
#define _USB_1_VECTOR                            34
#define _SPI1_FAULT_VECTOR                       35
#define _SPI1_RX_VECTOR                          36
#define _SPI1_TX_VECTOR                          37
#define _UART1_FAULT_VECTOR                      38
#define _UART1_RX_VECTOR                         39
#define _UART1_TX_VECTOR                         40
#define _I2C1_BUS_VECTOR                         41
#define _I2C1_SLAVE_VECTOR                       42
#define _I2C1_MASTER_VECTOR                      43
#define _CHANGE_NOTICE_A_VECTOR                  44
#define _CHANGE_NOTICE_B_VECTOR                  45
#define _CHANGE_NOTICE_C_VECTOR                  46
#define _CHANGE_NOTICE_D_VECTOR                  47
#define _CHANGE_NOTICE_E_VECTOR                  48
#define _CHANGE_NOTICE_F_VECTOR                  49
#define _CHANGE_NOTICE_G_VECTOR                  50
#define _PMP_VECTOR                              51
#define _PMP_ERROR_VECTOR                        52
#define _SPI2_FAULT_VECTOR                       53
#define _SPI2_RX_VECTOR                          54
#define _SPI2_TX_VECTOR                          55
#define _UART2_FAULT_VECTOR                      56
#define _UART2_RX_VECTOR                         57
#define _UART2_TX_VECTOR                         58
#define _I2C2_BUS_VECTOR                         59
#define _I2C2_SLAVE_VECTOR                       60
#define _I2C2_MASTER_VECTOR                      61
#define _UART3_FAULT_VECTOR                      62
#define _UART3_RX_VECTOR                         63
#define _UART3_TX_VECTOR                         64
#define _UART4_FAULT_VECTOR                      65
#define _UART4_RX_VECTOR                         66
#define _UART4_TX_VECTOR                         67
#define _UART5_FAULT_VECTOR                      68
#define _UART5_RX_VECTOR                         69
#define _UART5_TX_VECTOR                         70
#define _CTMU_VECTOR                             71
#define _DMA0_VECTOR                             72
#define _DMA1_VECTOR                             73
#define _DMA2_VECTOR                             74
#define _DMA3_VECTOR                             75
#define _TIMER_6_VECTOR                          76
#define _INPUT_CAPTURE_6_ERROR_VECTOR            77
#define _INPUT_CAPTURE_6_VECTOR                  78
#define _OUTPUT_COMPARE_6_VECTOR                 79
#define _TIMER_7_VECTOR                          80
#define _INPUT_CAPTURE_7_ERROR_VECTOR            81
#define _INPUT_CAPTURE_7_VECTOR                  82
#define _OUTPUT_COMPARE_7_VECTOR                 83
#define _TIMER_8_VECTOR                          84
#define _INPUT_CAPTURE_8_ERROR_VECTOR            85
#define _INPUT_CAPTURE_8_VECTOR                  86
#define _OUTPUT_COMPARE_8_VECTOR                 87
#define _TIMER_9_VECTOR                          88
#define _INPUT_CAPTURE_9_ERROR_VECTOR            89
#define _INPUT_CAPTURE_9_VECTOR                  90
#define _OUTPUT_COMPARE_9_VECTOR                 91
#define _ADC_VECTOR                              92
#define _ADC_DC1_VECTOR                          94
#define _ADC_DC2_VECTOR                          95
#define _ADC_DF1_VECTOR                          96
#define _ADC_DF2_VECTOR                          97
#define _ADC_DF3_VECTOR                          98
#define _ADC_DF4_VECTOR                          99
#define _ADC_FAULT_VECTOR                        100
#define _ADC_EOS_VECTOR                          101
#define _ADC_ARDY_VECTOR                         102
#define _ADC_URDY_VECTOR                         103
#define _ADC_DMA_VECTOR                          104
#define _ADC_EARLY_VECTOR                        105
#define _ADC_DATA0_VECTOR                        106
#define _ADC_DATA1_VECTOR                        107
#define _ADC_DATA2_VECTOR                        108
#define _ADC_DATA3_VECTOR                        109
#define _ADC_DATA4_VECTOR                        110
#define _ADC_DATA5_VECTOR                        111
#define _ADC_DATA6_VECTOR                        112
#define _ADC_DATA7_VECTOR                        113
#define _ADC_DATA8_VECTOR                        114
#define _ADC_DATA9_VECTOR                        115
#define _ADC_DATA10_VECTOR                       116
#define _ADC_DATA11_VECTOR                       117
#define _ADC_DATA12_VECTOR                       118
#define _ADC_DATA13_VECTOR                       119
#define _ADC_DATA14_VECTOR                       120
#define _ADC_DATA15_VECTOR                       121
#define _ADC_DATA16_VECTOR                       122
#define _ADC_DATA17_VECTOR                       123
#define _ADC_DATA18_VECTOR                       124
#define _ADC_DATA19_VECTOR                       125
#define _ADC_DATA20_VECTOR                       126
#define _ADC_DATA21_VECTOR                       127
#define _ADC_DATA22_VECTOR                       128
#define _ADC_DATA23_VECTOR                       129
#define _ADC_DATA24_VECTOR                       130
#define _ADC_DATA25_VECTOR                       131
#define _ADC_DATA26_VECTOR                       132
#define _ADC_DATA27_VECTOR                       133
#define _ADC_DATA33_VECTOR                       139
#define _ADC_DATA34_VECTOR                       140
#define _ADC_DATA35_VECTOR                       141
#define _ADC_DATA36_VECTOR                       142
#define _ADC_DATA37_VECTOR                       143
#define _ADC_DATA38_VECTOR                       144
#define _ADC_DATA39_VECTOR                       145
#define _ADC_DATA40_VECTOR                       146
#define _ADC_DATA41_VECTOR                       147
#define _ADC_DATA45_VECTOR                       151
#define _ADC_DATA46_VECTOR                       152
#define _ADC_DATA47_VECTOR                       153
#define _ADC_DATA48_VECTOR                       154
#define _ADC_DATA49_VECTOR                       155
#define _ADC_DATA50_VECTOR                       156
#define _ADC_DATA51_VECTOR                       157
#define _ADC_DATA52_VECTOR                       158
#define _ADC_DATA53_VECTOR                       159
#define _COMPARATOR_3_VECTOR                     160
#define _COMPARATOR_4_VECTOR                     161
#define _COMPARATOR_5_VECTOR                     162
#define _UART6_FAULT_VECTOR                      164
#define _UART6_RX_VECTOR                         165
#define _UART6_TX_VECTOR                         166
#define _I2C3_BUS_VECTOR                         179
#define _I2C3_SLAVE_VECTOR                       180
#define _I2C3_MASTER_VECTOR                      181
#define _DMA4_VECTOR                             182
#define _DMA5_VECTOR                             183
#define _DMA6_VECTOR                             184
#define _DMA7_VECTOR                             185
#define _DATA_EE_VECTOR                          186
#define _I2C4_BUS_VECTOR                         194
#define _I2C4_SLAVE_VECTOR                       195
#define _I2C4_MASTER_VECTOR                      196
#define _INPUT_CAPTURE_10_ERROR_VECTOR           197
#define _INPUT_CAPTURE_10_VECTOR                 198
#define _OUTPUT_COMPARE_10_VECTOR                199
#define _INPUT_CAPTURE_11_ERROR_VECTOR           200
#define _INPUT_CAPTURE_11_VECTOR                 201
#define _OUTPUT_COMPARE_11_VECTOR                202
#define _INPUT_CAPTURE_12_ERROR_VECTOR           203
#define _INPUT_CAPTURE_12_VECTOR                 204
#define _OUTPUT_COMPARE_12_VECTOR                205
#define _INPUT_CAPTURE_13_ERROR_VECTOR           206
#define _INPUT_CAPTURE_13_VECTOR                 207
#define _OUTPUT_COMPARE_13_VECTOR                208
#define _INPUT_CAPTURE_14_ERROR_VECTOR           209
#define _INPUT_CAPTURE_14_VECTOR                 210
#define _OUTPUT_COMPARE_14_VECTOR                211
#define _INPUT_CAPTURE_15_ERROR_VECTOR           212
#define _INPUT_CAPTURE_15_VECTOR                 213
#define _OUTPUT_COMPARE_15_VECTOR                214
#define _INPUT_CAPTURE_16_ERROR_VECTOR           215
#define _INPUT_CAPTURE_16_VECTOR                 216
#define _OUTPUT_COMPARE_16_VECTOR                217
#define _SPI3_FAULT_VECTOR                       218
#define _SPI3_RX_VECTOR                          219
#define _SPI3_TX_VECTOR                          220
#define _SPI4_FAULT_VECTOR                       221
#define _SPI4_RX_VECTOR                          222
#define _SPI4_TX_VECTOR                          223
#define _SPI5_FAULT_VECTOR                       224
#define _SPI5_RX_VECTOR                          225
#define _SPI5_TX_VECTOR                          226
#define _SPI6_FAULT_VECTOR                       227
#define _SPI6_RX_VECTOR                          228
#define _SPI6_TX_VECTOR                          229
#define _SYSTEM_BUS_PROTECTION_VECTOR            230
#define _USB_2_VECTOR                            244
#define _ADC_DC3_VECTOR                          245
#define _ADC_DC4_VECTOR                          246
#define _CORE_PERF_COUNT_VECTOR                  254
#define _CORE_FAST_DEBUG_CHAN_VECTOR             255

/* Device Peripherals */
#define _ADCHS
#define _CDAC1
#define _CDAC2
#define _CDAC3
#define _CFG
#define _CMP1
#define _CMP2
#define _CMP3
#define _CMP4
#define _CMP5
#define _CRU
#define _CTMU
#define _DMAC
#define _DMT
#define _EEPROM
#define _HLVD
#define _I2C1
#define _I2C2
#define _I2C3
#define _I2C4
#define _ICAP1
#define _ICAP10
#define _ICAP11
#define _ICAP12
#define _ICAP13
#define _ICAP14
#define _ICAP15
#define _ICAP16
#define _ICAP2
#define _ICAP3
#define _ICAP4
#define _ICAP5
#define _ICAP6
#define _ICAP7
#define _ICAP8
#define _ICAP9
#define _INT
#define _NVM
#define _OCMP1
#define _OCMP10
#define _OCMP11
#define _OCMP12
#define _OCMP13
#define _OCMP14
#define _OCMP15
#define _OCMP16
#define _OCMP2
#define _OCMP3
#define _OCMP4
#define _OCMP5
#define _OCMP6
#define _OCMP7
#define _OCMP8
#define _OCMP9
#define _PCACHE
#define _PMP
#define _PORTA
#define _PORTB
#define _PORTC
#define _PORTD
#define _PORTE
#define _PORTF
#define _PORTG
#define _RTCC
#define _SB
#define _SPI1
#define _SPI2
#define _SPI3
#define _SPI4
#define _SPI5
#define _SPI6
#define _TMR1
#define _TMR2
#define _TMR3
#define _TMR4
#define _TMR5
#define _TMR6
#define _TMR7
#define _TMR8
#define _TMR9
#define _UART1
#define _UART2
#define _UART3
#define _UART4
#define _UART5
#define _UART6
#define _UARTAB
#define _UARTCD
#define _UARTEF
#define _UARTGH
#define _UARTJK
#define _UARTLM
#define _USB
#define _USB1
#define _USB2
#define _WDT
#define __DDPSTAT

